export const GOAL_DONE = "달성완료";

// 레벨별 정보
export const LEVEL_INFO = [
  {
    v: " 1",
    p: 0,
    m: 24,
    l: "멤버(24명)",
    s: [
      { v: " 1", p: 800, m: 24, l: "상점(스바로그)" },
      { v: " 1", p: 1600, m: 24, l: "흙먼지(공15%)" },
    ],
  },
  {
    v: " 2",
    p: 2400,
    m: 26,
    l: "멤버(26명)",
    s: [
      { v: " 2", p: 4240, m: 26, l: "보급증가2" },
      { v: " 2", p: 6080, m: 26, l: "상점(스바로그재련)" },
    ],
  },
  {
    v: " 3",
    p: 7920,
    m: 28,
    l: "멤버(28명)",
    s: [
      { v: " 3", p: 12080, m: 28, l: "흙먼지(범위30%)" },
      { v: " 3", p: 16240, m: 28, l: "과업명성(550)" },
    ],
  },
  {
    v: " 4",
    p: 20400,
    m: 30,
    l: "멤버(30명)",
    s: [
      { v: " 4", p: 27120, m: 30, l: "보급증가3" },
      { v: " 4", p: 33840, m: 30, l: "상점(스바로그재련)" },
    ],
  },
  {
    v: " 5",
    p: 40560,
    m: 32,
    l: "멤버(32명)",
    s: [
      { v: " 5", p: 52560, m: 32, l: "흙먼지(단일30%)" },
      { v: " 5", p: 64560, m: 32, l: "과업명성(600)" },
    ],
  },
  {
    v: " 6",
    p: 76560,
    m: 34,
    l: "멤버(34명)",
    s: [
      { v: " 6", p: 102160, m: 34, l: "보급증가4" },
      { v: " 6", p: 127760, m: 34, l: "상점(스바로그재련)" },
    ],
  },
  {
    v: " 7",
    p: 153360,
    m: 36,
    l: "멤버(36명)",
    s: [
      { v: " 7", p: 207760, m: 36, l: "흙먼지(공25%)" },
      { v: " 7", p: 262160, m: 36, l: "과업명성(650)" },
    ],
  },
  {
    v: " 8",
    p: 316560,
    m: 38,
    l: "멤버(38명)",
    s: [
      { v: " 8", p: 374160, m: 38, l: "보급증가5" },
      { v: " 8", p: 431760, m: 38, l: "상점(스바로그재련)" },
    ],
  },
  {
    v: " 9",
    p: 489360,
    m: 39,
    l: "멤버(39명)",
    s: [
      { v: " 9", p: 610960, m: 39, l: "흙먼지(피증40%)" },
      { v: " 9", p: 732560, m: 39, l: "과업명성(700)" },
    ],
  },
  { v: "10", p: 854160, m: 40, l: "멤버(40명)", s: [] },
  { v: "11", p: 982160, m: 41, l: "멤버(41명)", s: [] },
  { v: "12", p: 1178960, m: 42, l: "멤버(42명)", s: [] },
  { v: "13", p: 1380560, m: 43, l: "멤버(43명)", s: [] },
  { v: "14", p: 1586960, m: 44, l: "멤버(44명)", s: [] },
  { v: "15", p: 1798160, m: 45, l: "멤버(45명)", s: [] },
  { v: "16", p: 2122160, m: 46, l: "멤버(46명)", s: [] },
  { v: "17", p: 2453360, m: 47, l: "멤버(47명)", s: [] },
  { v: "18", p: 2791760, m: 48, l: "멤버(48명)", s: [] },
  { v: "19", p: 3252560, m: 49, l: "멤버(49명)", s: [] },
  { v: "20", p: 3722960, m: 50, l: "멤버(50명)", s: [] },
];

// 필요한 경험치
export const UP_POINT = LEVEL_INFO.map(({ p }) => p);

// 1렙부터 인원수
export const MEMBER_COUNT = LEVEL_INFO.map(({ m }) => m);

type BasicData = { l: string; m: number; p: number; v: string };
export const FlatLevUpData: Array<
  (BasicData & { s: BasicData[]; type: "MAIN" }) | (BasicData & { type: "SUB" })
> = [];
LEVEL_INFO.forEach((mainInfo) => {
  FlatLevUpData.push({ ...mainInfo, type: "MAIN" });
  mainInfo.s.forEach((subInfo) => {
    FlatLevUpData.push({ ...subInfo, type: "SUB" });
  });
});
